Revit 2027 API
ParameterTypeId.EnergyAnalysisAdvancedOptions Property
 "Other Options": Deprecated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisAdvancedOptions { get; }
Public Shared ReadOnly Property EnergyAnalysisAdvancedOptions As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisAdvancedOptions {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisAdvancedOptions : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace